HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDsadc_bf.h
/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.ALEV2 */
#define IFX_DSADC_EVFLAG_ALEV2_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.ALEV2 */
#define IFX_DSADC_EVFLAG_ALEV2_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.ALEV2 */
#define IFX_DSADC_EVFLAG_ALEV2_OFF (18)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.ALEV3 */
#define IFX_DSADC_EVFLAG_ALEV3_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.ALEV3 */
#define IFX_DSADC_EVFLAG_ALEV3_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.ALEV3 */
#define IFX_DSADC_EVFLAG_ALEV3_OFF (19)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.ALEV4 */
#define IFX_DSADC_EVFLAG_ALEV4_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.ALEV4 */
#define IFX_DSADC_EVFLAG_ALEV4_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.ALEV4 */
#define IFX_DSADC_EVFLAG_ALEV4_OFF (20)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.ALEV5 */
#define IFX_DSADC_EVFLAG_ALEV5_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.ALEV5 */
#define IFX_DSADC_EVFLAG_ALEV5_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.ALEV5 */
#define IFX_DSADC_EVFLAG_ALEV5_OFF (21)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.ALEV6 */
#define IFX_DSADC_EVFLAG_ALEV6_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.ALEV6 */
#define IFX_DSADC_EVFLAG_ALEV6_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.ALEV6 */
#define IFX_DSADC_EVFLAG_ALEV6_OFF (22)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.ALEV7 */
#define IFX_DSADC_EVFLAG_ALEV7_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.ALEV7 */
#define IFX_DSADC_EVFLAG_ALEV7_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.ALEV7 */
#define IFX_DSADC_EVFLAG_ALEV7_OFF (23)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.ALEV8 */
#define IFX_DSADC_EVFLAG_ALEV8_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.ALEV8 */
#define IFX_DSADC_EVFLAG_ALEV8_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.ALEV8 */
#define IFX_DSADC_EVFLAG_ALEV8_OFF (24)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.ALEV9 */
#define IFX_DSADC_EVFLAG_ALEV9_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.ALEV9 */
#define IFX_DSADC_EVFLAG_ALEV9_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.ALEV9 */
#define IFX_DSADC_EVFLAG_ALEV9_OFF (25)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.RESEV0 */
#define IFX_DSADC_EVFLAG_RESEV0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.RESEV0 */
#define IFX_DSADC_EVFLAG_RESEV0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.RESEV0 */
#define IFX_DSADC_EVFLAG_RESEV0_OFF (0)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.RESEV1 */
#define IFX_DSADC_EVFLAG_RESEV1_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.RESEV1 */
#define IFX_DSADC_EVFLAG_RESEV1_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.RESEV1 */
#define IFX_DSADC_EVFLAG_RESEV1_OFF (1)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.RESEV2 */
#define IFX_DSADC_EVFLAG_RESEV2_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.RESEV2 */
#define IFX_DSADC_EVFLAG_RESEV2_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.RESEV2 */
#define IFX_DSADC_EVFLAG_RESEV2_OFF (2)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.RESEV3 */
#define IFX_DSADC_EVFLAG_RESEV3_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.RESEV3 */
#define IFX_DSADC_EVFLAG_RESEV3_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.RESEV3 */
#define IFX_DSADC_EVFLAG_RESEV3_OFF (3)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.RESEV4 */
#define IFX_DSADC_EVFLAG_RESEV4_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.RESEV4 */
#define IFX_DSADC_EVFLAG_RESEV4_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.RESEV4 */
#define IFX_DSADC_EVFLAG_RESEV4_OFF (4)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.RESEV5 */
#define IFX_DSADC_EVFLAG_RESEV5_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.RESEV5 */
#define IFX_DSADC_EVFLAG_RESEV5_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.RESEV5 */
#define IFX_DSADC_EVFLAG_RESEV5_OFF (5)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.RESEV6 */
#define IFX_DSADC_EVFLAG_RESEV6_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.RESEV6 */
#define IFX_DSADC_EVFLAG_RESEV6_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.RESEV6 */
#define IFX_DSADC_EVFLAG_RESEV6_OFF (6)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.RESEV7 */
#define IFX_DSADC_EVFLAG_RESEV7_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.RESEV7 */
#define IFX_DSADC_EVFLAG_RESEV7_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.RESEV7 */
#define IFX_DSADC_EVFLAG_RESEV7_OFF (7)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.RESEV8 */
#define IFX_DSADC_EVFLAG_RESEV8_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.RESEV8 */
#define IFX_DSADC_EVFLAG_RESEV8_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.RESEV8 */
#define IFX_DSADC_EVFLAG_RESEV8_OFF (8)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.RESEV9 */
#define IFX_DSADC_EVFLAG_RESEV9_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.RESEV9 */
#define IFX_DSADC_EVFLAG_RESEV9_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.RESEV9 */
#define IFX_DSADC_EVFLAG_RESEV9_OFF (9)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.ALEC0 */
#define IFX_DSADC_EVFLAGCLR_ALEC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.ALEC0 */
#define IFX_DSADC_EVFLAGCLR_ALEC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.ALEC0 */
#define IFX_DSADC_EVFLAGCLR_ALEC0_OFF (16)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.ALEC1 */
#define IFX_DSADC_EVFLAGCLR_ALEC1_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.ALEC1 */
#define IFX_DSADC_EVFLAGCLR_ALEC1_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.ALEC1 */
#define IFX_DSADC_EVFLAGCLR_ALEC1_OFF (17)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.ALEC2 */
#define IFX_DSADC_EVFLAGCLR_ALEC2_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.ALEC2 */
#define IFX_DSADC_EVFLAGCLR_ALEC2_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.ALEC2 */
#define IFX_DSADC_EVFLAGCLR_ALEC2_OFF (18)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.ALEC3 */
#define IFX_DSADC_EVFLAGCLR_ALEC3_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.ALEC3 */
#define IFX_DSADC_EVFLAGCLR_ALEC3_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.ALEC3 */
#define IFX_DSADC_EVFLAGCLR_ALEC3_OFF (19)

