HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDsadc_bf.h
/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.ALEC4 */
#define IFX_DSADC_EVFLAGCLR_ALEC4_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.ALEC4 */
#define IFX_DSADC_EVFLAGCLR_ALEC4_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.ALEC4 */
#define IFX_DSADC_EVFLAGCLR_ALEC4_OFF (20)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.ALEC5 */
#define IFX_DSADC_EVFLAGCLR_ALEC5_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.ALEC5 */
#define IFX_DSADC_EVFLAGCLR_ALEC5_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.ALEC5 */
#define IFX_DSADC_EVFLAGCLR_ALEC5_OFF (21)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.ALEC6 */
#define IFX_DSADC_EVFLAGCLR_ALEC6_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.ALEC6 */
#define IFX_DSADC_EVFLAGCLR_ALEC6_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.ALEC6 */
#define IFX_DSADC_EVFLAGCLR_ALEC6_OFF (22)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.ALEC7 */
#define IFX_DSADC_EVFLAGCLR_ALEC7_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.ALEC7 */
#define IFX_DSADC_EVFLAGCLR_ALEC7_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.ALEC7 */
#define IFX_DSADC_EVFLAGCLR_ALEC7_OFF (23)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.ALEC8 */
#define IFX_DSADC_EVFLAGCLR_ALEC8_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.ALEC8 */
#define IFX_DSADC_EVFLAGCLR_ALEC8_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.ALEC8 */
#define IFX_DSADC_EVFLAGCLR_ALEC8_OFF (24)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.ALEC9 */
#define IFX_DSADC_EVFLAGCLR_ALEC9_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.ALEC9 */
#define IFX_DSADC_EVFLAGCLR_ALEC9_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.ALEC9 */
#define IFX_DSADC_EVFLAGCLR_ALEC9_OFF (25)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC0 */
#define IFX_DSADC_EVFLAGCLR_RESEC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC0 */
#define IFX_DSADC_EVFLAGCLR_RESEC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC0 */
#define IFX_DSADC_EVFLAGCLR_RESEC0_OFF (0)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC1 */
#define IFX_DSADC_EVFLAGCLR_RESEC1_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC1 */
#define IFX_DSADC_EVFLAGCLR_RESEC1_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC1 */
#define IFX_DSADC_EVFLAGCLR_RESEC1_OFF (1)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC2 */
#define IFX_DSADC_EVFLAGCLR_RESEC2_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC2 */
#define IFX_DSADC_EVFLAGCLR_RESEC2_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC2 */
#define IFX_DSADC_EVFLAGCLR_RESEC2_OFF (2)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC3 */
#define IFX_DSADC_EVFLAGCLR_RESEC3_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC3 */
#define IFX_DSADC_EVFLAGCLR_RESEC3_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC3 */
#define IFX_DSADC_EVFLAGCLR_RESEC3_OFF (3)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC4 */
#define IFX_DSADC_EVFLAGCLR_RESEC4_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC4 */
#define IFX_DSADC_EVFLAGCLR_RESEC4_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC4 */
#define IFX_DSADC_EVFLAGCLR_RESEC4_OFF (4)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC5 */
#define IFX_DSADC_EVFLAGCLR_RESEC5_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC5 */
#define IFX_DSADC_EVFLAGCLR_RESEC5_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC5 */
#define IFX_DSADC_EVFLAGCLR_RESEC5_OFF (5)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC6 */
#define IFX_DSADC_EVFLAGCLR_RESEC6_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC6 */
#define IFX_DSADC_EVFLAGCLR_RESEC6_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC6 */
#define IFX_DSADC_EVFLAGCLR_RESEC6_OFF (6)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC7 */
#define IFX_DSADC_EVFLAGCLR_RESEC7_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC7 */
#define IFX_DSADC_EVFLAGCLR_RESEC7_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC7 */
#define IFX_DSADC_EVFLAGCLR_RESEC7_OFF (7)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC8 */
#define IFX_DSADC_EVFLAGCLR_RESEC8_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC8 */
#define IFX_DSADC_EVFLAGCLR_RESEC8_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC8 */
#define IFX_DSADC_EVFLAGCLR_RESEC8_OFF (8)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC9 */
#define IFX_DSADC_EVFLAGCLR_RESEC9_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC9 */
#define IFX_DSADC_EVFLAGCLR_RESEC9_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC9 */
#define IFX_DSADC_EVFLAGCLR_RESEC9_OFF (9)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.IBSEL */
#define IFX_DSADC_GLOBCFG_IBSEL_LEN (4)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.IBSEL */
#define IFX_DSADC_GLOBCFG_IBSEL_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.IBSEL */
#define IFX_DSADC_GLOBCFG_IBSEL_OFF (16)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.ICT */
#define IFX_DSADC_GLOBCFG_ICT_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.ICT */
#define IFX_DSADC_GLOBCFG_ICT_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.ICT */
#define IFX_DSADC_GLOBCFG_ICT_OFF (22)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.IRM0 */
#define IFX_DSADC_GLOBCFG_IRM0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.IRM0 */
#define IFX_DSADC_GLOBCFG_IRM0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.IRM0 */
#define IFX_DSADC_GLOBCFG_IRM0_OFF (11)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.IRM2 */
#define IFX_DSADC_GLOBCFG_IRM2_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.IRM2 */
#define IFX_DSADC_GLOBCFG_IRM2_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.IRM2 */
#define IFX_DSADC_GLOBCFG_IRM2_OFF (12)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.IRM4 */
#define IFX_DSADC_GLOBCFG_IRM4_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.IRM4 */
#define IFX_DSADC_GLOBCFG_IRM4_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.IRM4 */
#define IFX_DSADC_GLOBCFG_IRM4_OFF (13)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.IRM6 */
#define IFX_DSADC_GLOBCFG_IRM6_LEN (1)

