HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDsadc_bf.h
/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.IRM6 */
#define IFX_DSADC_GLOBCFG_IRM6_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.IRM6 */
#define IFX_DSADC_GLOBCFG_IRM6_OFF (14)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.IRM8 */
#define IFX_DSADC_GLOBCFG_IRM8_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.IRM8 */
#define IFX_DSADC_GLOBCFG_IRM8_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.IRM8 */
#define IFX_DSADC_GLOBCFG_IRM8_OFF (15)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.LOSUP */
#define IFX_DSADC_GLOBCFG_LOSUP_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.LOSUP */
#define IFX_DSADC_GLOBCFG_LOSUP_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.LOSUP */
#define IFX_DSADC_GLOBCFG_LOSUP_OFF (20)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.MCSEL */
#define IFX_DSADC_GLOBCFG_MCSEL_LEN (3)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.MCSEL */
#define IFX_DSADC_GLOBCFG_MCSEL_MSK (0x7)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.MCSEL */
#define IFX_DSADC_GLOBCFG_MCSEL_OFF (0)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.PSWC */
#define IFX_DSADC_GLOBCFG_PSWC_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.PSWC */
#define IFX_DSADC_GLOBCFG_PSWC_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.PSWC */
#define IFX_DSADC_GLOBCFG_PSWC_OFF (23)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH0RUN */
#define IFX_DSADC_GLOBRC_CH0RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH0RUN */
#define IFX_DSADC_GLOBRC_CH0RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH0RUN */
#define IFX_DSADC_GLOBRC_CH0RUN_OFF (0)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH1RUN */
#define IFX_DSADC_GLOBRC_CH1RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH1RUN */
#define IFX_DSADC_GLOBRC_CH1RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH1RUN */
#define IFX_DSADC_GLOBRC_CH1RUN_OFF (1)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH2RUN */
#define IFX_DSADC_GLOBRC_CH2RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH2RUN */
#define IFX_DSADC_GLOBRC_CH2RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH2RUN */
#define IFX_DSADC_GLOBRC_CH2RUN_OFF (2)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH3RUN */
#define IFX_DSADC_GLOBRC_CH3RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH3RUN */
#define IFX_DSADC_GLOBRC_CH3RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH3RUN */
#define IFX_DSADC_GLOBRC_CH3RUN_OFF (3)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH4RUN */
#define IFX_DSADC_GLOBRC_CH4RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH4RUN */
#define IFX_DSADC_GLOBRC_CH4RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH4RUN */
#define IFX_DSADC_GLOBRC_CH4RUN_OFF (4)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH5RUN */
#define IFX_DSADC_GLOBRC_CH5RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH5RUN */
#define IFX_DSADC_GLOBRC_CH5RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH5RUN */
#define IFX_DSADC_GLOBRC_CH5RUN_OFF (5)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH6RUN */
#define IFX_DSADC_GLOBRC_CH6RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH6RUN */
#define IFX_DSADC_GLOBRC_CH6RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH6RUN */
#define IFX_DSADC_GLOBRC_CH6RUN_OFF (6)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH7RUN */
#define IFX_DSADC_GLOBRC_CH7RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH7RUN */
#define IFX_DSADC_GLOBRC_CH7RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH7RUN */
#define IFX_DSADC_GLOBRC_CH7RUN_OFF (7)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH8RUN */
#define IFX_DSADC_GLOBRC_CH8RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH8RUN */
#define IFX_DSADC_GLOBRC_CH8RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH8RUN */
#define IFX_DSADC_GLOBRC_CH8RUN_OFF (8)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH9RUN */
#define IFX_DSADC_GLOBRC_CH9RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH9RUN */
#define IFX_DSADC_GLOBRC_CH9RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH9RUN */
#define IFX_DSADC_GLOBRC_CH9RUN_OFF (9)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M0RUN */
#define IFX_DSADC_GLOBRC_M0RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M0RUN */
#define IFX_DSADC_GLOBRC_M0RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M0RUN */
#define IFX_DSADC_GLOBRC_M0RUN_OFF (16)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M1RUN */
#define IFX_DSADC_GLOBRC_M1RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M1RUN */
#define IFX_DSADC_GLOBRC_M1RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M1RUN */
#define IFX_DSADC_GLOBRC_M1RUN_OFF (17)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M2RUN */
#define IFX_DSADC_GLOBRC_M2RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M2RUN */
#define IFX_DSADC_GLOBRC_M2RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M2RUN */
#define IFX_DSADC_GLOBRC_M2RUN_OFF (18)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M3RUN */
#define IFX_DSADC_GLOBRC_M3RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M3RUN */
#define IFX_DSADC_GLOBRC_M3RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M3RUN */
#define IFX_DSADC_GLOBRC_M3RUN_OFF (19)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M4RUN */
#define IFX_DSADC_GLOBRC_M4RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M4RUN */
#define IFX_DSADC_GLOBRC_M4RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M4RUN */
#define IFX_DSADC_GLOBRC_M4RUN_OFF (20)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M5RUN */
#define IFX_DSADC_GLOBRC_M5RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M5RUN */
#define IFX_DSADC_GLOBRC_M5RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M5RUN */
#define IFX_DSADC_GLOBRC_M5RUN_OFF (21)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M6RUN */
#define IFX_DSADC_GLOBRC_M6RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M6RUN */
#define IFX_DSADC_GLOBRC_M6RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M6RUN */
#define IFX_DSADC_GLOBRC_M6RUN_OFF (22)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M7RUN */
#define IFX_DSADC_GLOBRC_M7RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M7RUN */
#define IFX_DSADC_GLOBRC_M7RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M7RUN */
#define IFX_DSADC_GLOBRC_M7RUN_OFF (23)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M8RUN */
#define IFX_DSADC_GLOBRC_M8RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M8RUN */
#define IFX_DSADC_GLOBRC_M8RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M8RUN */
#define IFX_DSADC_GLOBRC_M8RUN_OFF (24)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M9RUN */
#define IFX_DSADC_GLOBRC_M9RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M9RUN */
#define IFX_DSADC_GLOBRC_M9RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M9RUN */
#define IFX_DSADC_GLOBRC_M9RUN_OFF (25)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN0NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN0NVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN0NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN0NVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN0NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN0NVC0_OFF (4)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN0PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN0PVC0_LEN (1)

