HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDsadc_bf.h
/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN0PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN0PVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN0PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN0PVC0_OFF (0)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN1NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN1NVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN1NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN1NVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN1NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN1NVC0_OFF (12)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN1PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN1PVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN1PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN1PVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN1PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN1PVC0_OFF (8)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN2NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN2NVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN2NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN2NVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN2NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN2NVC0_OFF (20)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN2NVC1 */
#define IFX_DSADC_GLOBVCMH0_IN2NVC1_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN2NVC1 */
#define IFX_DSADC_GLOBVCMH0_IN2NVC1_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN2NVC1 */
#define IFX_DSADC_GLOBVCMH0_IN2NVC1_OFF (21)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN2PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN2PVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN2PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN2PVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN2PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN2PVC0_OFF (16)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN2PVC1 */
#define IFX_DSADC_GLOBVCMH0_IN2PVC1_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN2PVC1 */
#define IFX_DSADC_GLOBVCMH0_IN2PVC1_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN2PVC1 */
#define IFX_DSADC_GLOBVCMH0_IN2PVC1_OFF (17)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC0_OFF (28)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC1 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC1_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC1 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC1_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC1 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC1_OFF (29)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC2 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC2_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC2 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC2_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC2 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC2_OFF (30)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC3 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC3_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC3 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC3_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC3 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC3_OFF (31)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC0_OFF (24)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC1 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC1_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC1 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC1_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC1 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC1_OFF (25)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC2 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC2_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC2 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC2_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC2 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC2_OFF (26)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC3 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC3_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC3 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC3_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC3 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC3_OFF (27)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH1_Bits.IN4NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN4NVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH1_Bits.IN4NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN4NVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH1_Bits.IN4NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN4NVC0_OFF (4)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH1_Bits.IN4PVC0 */
#define IFX_DSADC_GLOBVCMH1_IN4PVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH1_Bits.IN4PVC0 */
#define IFX_DSADC_GLOBVCMH1_IN4PVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH1_Bits.IN4PVC0 */
#define IFX_DSADC_GLOBVCMH1_IN4PVC0_OFF (0)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH1_Bits.IN5NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN5NVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH1_Bits.IN5NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN5NVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH1_Bits.IN5NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN5NVC0_OFF (12)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH1_Bits.IN5PVC0 */
#define IFX_DSADC_GLOBVCMH1_IN5PVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH1_Bits.IN5PVC0 */
#define IFX_DSADC_GLOBVCMH1_IN5PVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH1_Bits.IN5PVC0 */
#define IFX_DSADC_GLOBVCMH1_IN5PVC0_OFF (8)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH1_Bits.IN6NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN6NVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH1_Bits.IN6NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN6NVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH1_Bits.IN6NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN6NVC0_OFF (20)

